bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/auadc_reg.h
/**
  ******************************************************************************
  * @file    auadc_reg.h
  * @version V1.0
  * @date    2022-05-11
  * @brief   This file is the description of.IP register
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT(c) 2020 Bouffalo Lab</center></h2>
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of Bouffalo Lab nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
#ifndef  __AUADC_REG_H__
#define  __AUADC_REG_H__

#include "bl702l.h"

/* 0xC00 : audpdm_top */
#define AUADC_AUDPDM_TOP_OFFSET                                (0x00)
#define AUADC_AUDIO_CKG_EN                                     AUADC_AUDIO_CKG_EN
#define AUADC_AUDIO_CKG_EN_POS                                 (0U)
#define AUADC_AUDIO_CKG_EN_LEN                                 (1U)
#define AUADC_AUDIO_CKG_EN_MSK                                 (((1U<<AUADC_AUDIO_CKG_EN_LEN)-1)<<AUADC_AUDIO_CKG_EN_POS)
#define AUADC_AUDIO_CKG_EN_UMSK                                (~(((1U<<AUADC_AUDIO_CKG_EN_LEN)-1)<<AUADC_AUDIO_CKG_EN_POS))
#define AUADC_ADC_ITF_INV_SEL                                  AUADC_ADC_ITF_INV_SEL
#define AUADC_ADC_ITF_INV_SEL_POS                              (2U)
#define AUADC_ADC_ITF_INV_SEL_LEN                              (1U)
#define AUADC_ADC_ITF_INV_SEL_MSK                              (((1U<<AUADC_ADC_ITF_INV_SEL_LEN)-1)<<AUADC_ADC_ITF_INV_SEL_POS)
#define AUADC_ADC_ITF_INV_SEL_UMSK                             (~(((1U<<AUADC_ADC_ITF_INV_SEL_LEN)-1)<<AUADC_ADC_ITF_INV_SEL_POS))
#define AUADC_PDM_ITF_INV_SEL                                  AUADC_PDM_ITF_INV_SEL
#define AUADC_PDM_ITF_INV_SEL_POS                              (3U)
#define AUADC_PDM_ITF_INV_SEL_LEN                              (1U)
#define AUADC_PDM_ITF_INV_SEL_MSK                              (((1U<<AUADC_PDM_ITF_INV_SEL_LEN)-1)<<AUADC_PDM_ITF_INV_SEL_POS)
#define AUADC_PDM_ITF_INV_SEL_UMSK                             (~(((1U<<AUADC_PDM_ITF_INV_SEL_LEN)-1)<<AUADC_PDM_ITF_INV_SEL_POS))
#define AUADC_ADC_RATE                                         AUADC_ADC_RATE
#define AUADC_ADC_RATE_POS                                     (28U)
#define AUADC_ADC_RATE_LEN                                     (4U)
#define AUADC_ADC_RATE_MSK                                     (((1U<<AUADC_ADC_RATE_LEN)-1)<<AUADC_ADC_RATE_POS)
#define AUADC_ADC_RATE_UMSK                                    (~(((1U<<AUADC_ADC_RATE_LEN)-1)<<AUADC_ADC_RATE_POS))

/* 0xC04 : audpdm_itf */
#define AUADC_AUDPDM_ITF_OFFSET                                (0x04)
#define AUADC_ADC_0_EN                                         AUADC_ADC_0_EN
#define AUADC_ADC_0_EN_POS                                     (0U)
#define AUADC_ADC_0_EN_LEN                                     (1U)
#define AUADC_ADC_0_EN_MSK                                     (((1U<<AUADC_ADC_0_EN_LEN)-1)<<AUADC_ADC_0_EN_POS)
#define AUADC_ADC_0_EN_UMSK                                    (~(((1U<<AUADC_ADC_0_EN_LEN)-1)<<AUADC_ADC_0_EN_POS))
#define AUADC_ADC_ITF_EN                                       AUADC_ADC_ITF_EN
#define AUADC_ADC_ITF_EN_POS                                   (30U)
#define AUADC_ADC_ITF_EN_LEN                                   (1U)
#define AUADC_ADC_ITF_EN_MSK                                   (((1U<<AUADC_ADC_ITF_EN_LEN)-1)<<AUADC_ADC_ITF_EN_POS)
#define AUADC_ADC_ITF_EN_UMSK                                  (~(((1U<<AUADC_ADC_ITF_EN_LEN)-1)<<AUADC_ADC_ITF_EN_POS))

/* 0xC08 : pdm_adc_0 */
#define AUADC_PDM_ADC_0_OFFSET                                 (0x008)
#define AUADC_ADC_0_FIR_MODE                                   AUADC_ADC_0_FIR_MODE
#define AUADC_ADC_0_FIR_MODE_POS                               (0U)
#define AUADC_ADC_0_FIR_MODE_LEN                               (1U)
#define AUADC_ADC_0_FIR_MODE_MSK                               (((1U<<AUADC_ADC_0_FIR_MODE_LEN)-1)<<AUADC_ADC_0_FIR_MODE_POS)
#define AUADC_ADC_0_FIR_MODE_UMSK                              (~(((1U<<AUADC_ADC_0_FIR_MODE_LEN)-1)<<AUADC_ADC_0_FIR_MODE_POS))

/* 0xC0C : pdm_adc_1 */
#define AUADC_PDM_ADC_1_OFFSET                                 (0x0C)
#define AUADC_ADC_0_K1                                         AUADC_ADC_0_K1
#define AUADC_ADC_0_K1_POS                                     (0U)
#define AUADC_ADC_0_K1_LEN                                     (4U)
#define AUADC_ADC_0_K1_MSK                                     (((1U<<AUADC_ADC_0_K1_LEN)-1)<<AUADC_ADC_0_K1_POS)
#define AUADC_ADC_0_K1_UMSK                                    (~(((1U<<AUADC_ADC_0_K1_LEN)-1)<<AUADC_ADC_0_K1_POS))
#define AUADC_ADC_0_K1_EN                                      AUADC_ADC_0_K1_EN
#define AUADC_ADC_0_K1_EN_POS                                  (4U)
#define AUADC_ADC_0_K1_EN_LEN                                  (1U)
#define AUADC_ADC_0_K1_EN_MSK                                  (((1U<<AUADC_ADC_0_K1_EN_LEN)-1)<<AUADC_ADC_0_K1_EN_POS)
#define AUADC_ADC_0_K1_EN_UMSK                                 (~(((1U<<AUADC_ADC_0_K1_EN_LEN)-1)<<AUADC_ADC_0_K1_EN_POS))
#define AUADC_ADC_0_K2                                         AUADC_ADC_0_K2
#define AUADC_ADC_0_K2_POS                                     (5U)
#define AUADC_ADC_0_K2_LEN                                     (4U)
#define AUADC_ADC_0_K2_MSK                                     (((1U<<AUADC_ADC_0_K2_LEN)-1)<<AUADC_ADC_0_K2_POS)
#define AUADC_ADC_0_K2_UMSK                                    (~(((1U<<AUADC_ADC_0_K2_LEN)-1)<<AUADC_ADC_0_K2_POS))
#define AUADC_ADC_0_K2_EN                                      AUADC_ADC_0_K2_EN
#define AUADC_ADC_0_K2_EN_POS                                  (9U)
#define AUADC_ADC_0_K2_EN_LEN                                  (1U)
#define AUADC_ADC_0_K2_EN_MSK                                  (((1U<<AUADC_ADC_0_K2_EN_LEN)-1)<<AUADC_ADC_0_K2_EN_POS)
#define AUADC_ADC_0_K2_EN_UMSK                                 (~(((1U<<AUADC_ADC_0_K2_EN_LEN)-1)<<AUADC_ADC_0_K2_EN_POS))

