bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/auadc_reg.h
/* 0xC10 : pdm_dac_0 */
#define AUADC_PDM_DAC_0_OFFSET                                 (0x10)
#define AUADC_ADC_PDM_H                                        AUADC_ADC_PDM_H
#define AUADC_ADC_PDM_H_POS                                    (0U)
#define AUADC_ADC_PDM_H_LEN                                    (4U)
#define AUADC_ADC_PDM_H_MSK                                    (((1U<<AUADC_ADC_PDM_H_LEN)-1)<<AUADC_ADC_PDM_H_POS)
#define AUADC_ADC_PDM_H_UMSK                                   (~(((1U<<AUADC_ADC_PDM_H_LEN)-1)<<AUADC_ADC_PDM_H_POS))
#define AUADC_ADC_PDM_L                                        AUADC_ADC_PDM_L
#define AUADC_ADC_PDM_L_POS                                    (6U)
#define AUADC_ADC_PDM_L_LEN                                    (4U)
#define AUADC_ADC_PDM_L_MSK                                    (((1U<<AUADC_ADC_PDM_L_LEN)-1)<<AUADC_ADC_PDM_L_POS)
#define AUADC_ADC_PDM_L_UMSK                                   (~(((1U<<AUADC_ADC_PDM_L_LEN)-1)<<AUADC_ADC_PDM_L_POS))
#define AUADC_ADC_0_SRC                                        AUADC_ADC_0_SRC
#define AUADC_ADC_0_SRC_POS                                    (12U)
#define AUADC_ADC_0_SRC_LEN                                    (1U)
#define AUADC_ADC_0_SRC_MSK                                    (((1U<<AUADC_ADC_0_SRC_LEN)-1)<<AUADC_ADC_0_SRC_POS)
#define AUADC_ADC_0_SRC_UMSK                                   (~(((1U<<AUADC_ADC_0_SRC_LEN)-1)<<AUADC_ADC_0_SRC_POS))

/* 0xC1C : pdm_pdm_0 */
#define AUADC_PDM_PDM_0_OFFSET                                 (0x1C)
#define AUADC_PDM_0_EN                                         AUADC_PDM_0_EN
#define AUADC_PDM_0_EN_POS                                     (0U)
#define AUADC_PDM_0_EN_LEN                                     (1U)
#define AUADC_PDM_0_EN_MSK                                     (((1U<<AUADC_PDM_0_EN_LEN)-1)<<AUADC_PDM_0_EN_POS)
#define AUADC_PDM_0_EN_UMSK                                    (~(((1U<<AUADC_PDM_0_EN_LEN)-1)<<AUADC_PDM_0_EN_POS))
#define AUADC_ADC_0_PDM_SEL                                    AUADC_ADC_0_PDM_SEL
#define AUADC_ADC_0_PDM_SEL_POS                                (3U)
#define AUADC_ADC_0_PDM_SEL_LEN                                (3U)
#define AUADC_ADC_0_PDM_SEL_MSK                                (((1U<<AUADC_ADC_0_PDM_SEL_LEN)-1)<<AUADC_ADC_0_PDM_SEL_POS)
#define AUADC_ADC_0_PDM_SEL_UMSK                               (~(((1U<<AUADC_ADC_0_PDM_SEL_LEN)-1)<<AUADC_ADC_0_PDM_SEL_POS))

/* 0xC20 : pdm_rsvd0 */
#define AUADC_PDM_RSVD0_OFFSET                                 (0x20)

/* 0xC24 : pdm_dbg_0 */
#define AUADC_PDM_DBG_0_OFFSET                                 (0x24)
#define AUADC_ADC_TEST_CLKIN_EN                                AUADC_ADC_TEST_CLKIN_EN
#define AUADC_ADC_TEST_CLKIN_EN_POS                            (21U)
#define AUADC_ADC_TEST_CLKIN_EN_LEN                            (1U)
#define AUADC_ADC_TEST_CLKIN_EN_MSK                            (((1U<<AUADC_ADC_TEST_CLKIN_EN_LEN)-1)<<AUADC_ADC_TEST_CLKIN_EN_POS)
#define AUADC_ADC_TEST_CLKIN_EN_UMSK                           (~(((1U<<AUADC_ADC_TEST_CLKIN_EN_LEN)-1)<<AUADC_ADC_TEST_CLKIN_EN_POS))
#define AUADC_ADC_TEST_DIN_EN                                  AUADC_ADC_TEST_DIN_EN
#define AUADC_ADC_TEST_DIN_EN_POS                              (23U)
#define AUADC_ADC_TEST_DIN_EN_LEN                              (1U)
#define AUADC_ADC_TEST_DIN_EN_MSK                              (((1U<<AUADC_ADC_TEST_DIN_EN_LEN)-1)<<AUADC_ADC_TEST_DIN_EN_POS)
#define AUADC_ADC_TEST_DIN_EN_UMSK                             (~(((1U<<AUADC_ADC_TEST_DIN_EN_LEN)-1)<<AUADC_ADC_TEST_DIN_EN_POS))
#define AUADC_AUD_TEST_READ_SEL                                AUADC_AUD_TEST_READ_SEL
#define AUADC_AUD_TEST_READ_SEL_POS                            (24U)
#define AUADC_AUD_TEST_READ_SEL_LEN                            (6U)
#define AUADC_AUD_TEST_READ_SEL_MSK                            (((1U<<AUADC_AUD_TEST_READ_SEL_LEN)-1)<<AUADC_AUD_TEST_READ_SEL_POS)
#define AUADC_AUD_TEST_READ_SEL_UMSK                           (~(((1U<<AUADC_AUD_TEST_READ_SEL_LEN)-1)<<AUADC_AUD_TEST_READ_SEL_POS))

/* 0xC28 : pdm_dbg_1 */
#define AUADC_PDM_DBG_1_OFFSET                                 (0x28)
#define AUADC_AUD_TEST_READ                                    AUADC_AUD_TEST_READ
#define AUADC_AUD_TEST_READ_POS                                (0U)
#define AUADC_AUD_TEST_READ_LEN                                (32U)
#define AUADC_AUD_TEST_READ_MSK                                (((1U<<AUADC_AUD_TEST_READ_LEN)-1)<<AUADC_AUD_TEST_READ_POS)
#define AUADC_AUD_TEST_READ_UMSK                               (~(((1U<<AUADC_AUD_TEST_READ_LEN)-1)<<AUADC_AUD_TEST_READ_POS))

/* 0xC2C : pdm_dbg_2 */
#define AUADC_PDM_DBG_2_OFFSET                                 (0x2C)
#define AUADC_ADC_FIR_4S_VAL                                   AUADC_ADC_FIR_4S_VAL
#define AUADC_ADC_FIR_4S_VAL_POS                               (0U)
#define AUADC_ADC_FIR_4S_VAL_LEN                               (20U)
#define AUADC_ADC_FIR_4S_VAL_MSK                               (((1U<<AUADC_ADC_FIR_4S_VAL_LEN)-1)<<AUADC_ADC_FIR_4S_VAL_POS)
#define AUADC_ADC_FIR_4S_VAL_UMSK                              (~(((1U<<AUADC_ADC_FIR_4S_VAL_LEN)-1)<<AUADC_ADC_FIR_4S_VAL_POS))
#define AUADC_ADC_0_FIR_4S_EN                                  AUADC_ADC_0_FIR_4S_EN
#define AUADC_ADC_0_FIR_4S_EN_POS                              (20U)
#define AUADC_ADC_0_FIR_4S_EN_LEN                              (1U)
#define AUADC_ADC_0_FIR_4S_EN_MSK                              (((1U<<AUADC_ADC_0_FIR_4S_EN_LEN)-1)<<AUADC_ADC_0_FIR_4S_EN_POS)
#define AUADC_ADC_0_FIR_4S_EN_UMSK                             (~(((1U<<AUADC_ADC_0_FIR_4S_EN_LEN)-1)<<AUADC_ADC_0_FIR_4S_EN_POS))

/* 0xC30 : pdm_dbg_3 */
#define AUADC_PDM_DBG_3_OFFSET                                 (0x30)

/* 0xC34 : pdm_dbg_4 */
#define AUADC_PDM_DBG_4_OFFSET                                 (0x34)

/* 0xC38 : pdm_adc_s0 */
#define AUADC_PDM_ADC_S0_OFFSET                                (0x38)
#define AUADC_ADC_S0_VOLUME                                    AUADC_ADC_S0_VOLUME
#define AUADC_ADC_S0_VOLUME_POS                                (0U)
#define AUADC_ADC_S0_VOLUME_LEN                                (9U)
#define AUADC_ADC_S0_VOLUME_MSK                                (((1U<<AUADC_ADC_S0_VOLUME_LEN)-1)<<AUADC_ADC_S0_VOLUME_POS)
#define AUADC_ADC_S0_VOLUME_UMSK                               (~(((1U<<AUADC_ADC_S0_VOLUME_LEN)-1)<<AUADC_ADC_S0_VOLUME_POS))

/* 0xC3C : pdm_adc_s1 */
#define AUADC_PDM_ADC_S1_OFFSET                                (0x3C)

/* 0xC40 : pdm_adc_s2 */
#define AUADC_PDM_ADC_S2_OFFSET                                (0x40)

/* 0xC60 : audadc_ana_cfg1 */
#define AUADC_AUDADC_ANA_CFG1_OFFSET                           (0x60)
#define AUADC_AUDADC_PGA_CHOP_CKSEL                            AUADC_AUDADC_PGA_CHOP_CKSEL
#define AUADC_AUDADC_PGA_CHOP_CKSEL_POS                        (0U)
#define AUADC_AUDADC_PGA_CHOP_CKSEL_LEN                        (1U)
#define AUADC_AUDADC_PGA_CHOP_CKSEL_MSK                        (((1U<<AUADC_AUDADC_PGA_CHOP_CKSEL_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_CKSEL_POS)
#define AUADC_AUDADC_PGA_CHOP_CKSEL_UMSK                       (~(((1U<<AUADC_AUDADC_PGA_CHOP_CKSEL_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_CKSEL_POS))
#define AUADC_AUDADC_PGA_CHOP_FREQ                             AUADC_AUDADC_PGA_CHOP_FREQ
#define AUADC_AUDADC_PGA_CHOP_FREQ_POS                         (1U)
#define AUADC_AUDADC_PGA_CHOP_FREQ_LEN                         (3U)
#define AUADC_AUDADC_PGA_CHOP_FREQ_MSK                         (((1U<<AUADC_AUDADC_PGA_CHOP_FREQ_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_FREQ_POS)
#define AUADC_AUDADC_PGA_CHOP_FREQ_UMSK                        (~(((1U<<AUADC_AUDADC_PGA_CHOP_FREQ_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_FREQ_POS))
#define AUADC_AUDADC_PGA_CHOP_EN                               AUADC_AUDADC_PGA_CHOP_EN
#define AUADC_AUDADC_PGA_CHOP_EN_POS                           (4U)
#define AUADC_AUDADC_PGA_CHOP_EN_LEN                           (1U)
#define AUADC_AUDADC_PGA_CHOP_EN_MSK                           (((1U<<AUADC_AUDADC_PGA_CHOP_EN_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_EN_POS)
#define AUADC_AUDADC_PGA_CHOP_EN_UMSK                          (~(((1U<<AUADC_AUDADC_PGA_CHOP_EN_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_EN_POS))
#define AUADC_AUDADC_PGA_CHOP_CFG                              AUADC_AUDADC_PGA_CHOP_CFG
#define AUADC_AUDADC_PGA_CHOP_CFG_POS                          (5U)
#define AUADC_AUDADC_PGA_CHOP_CFG_LEN                          (2U)
#define AUADC_AUDADC_PGA_CHOP_CFG_MSK                          (((1U<<AUADC_AUDADC_PGA_CHOP_CFG_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_CFG_POS)
#define AUADC_AUDADC_PGA_CHOP_CFG_UMSK                         (~(((1U<<AUADC_AUDADC_PGA_CHOP_CFG_LEN)-1)<<AUADC_AUDADC_PGA_CHOP_CFG_POS))
#define AUADC_AUDADC_PGA_RHPAS_SEL                             AUADC_AUDADC_PGA_RHPAS_SEL
#define AUADC_AUDADC_PGA_RHPAS_SEL_POS                         (8U)
#define AUADC_AUDADC_PGA_RHPAS_SEL_LEN                         (2U)
#define AUADC_AUDADC_PGA_RHPAS_SEL_MSK                         (((1U<<AUADC_AUDADC_PGA_RHPAS_SEL_LEN)-1)<<AUADC_AUDADC_PGA_RHPAS_SEL_POS)
#define AUADC_AUDADC_PGA_RHPAS_SEL_UMSK                        (~(((1U<<AUADC_AUDADC_PGA_RHPAS_SEL_LEN)-1)<<AUADC_AUDADC_PGA_RHPAS_SEL_POS))
#define AUADC_AUDADC_PGA_NOIS_CTRL                             AUADC_AUDADC_PGA_NOIS_CTRL
#define AUADC_AUDADC_PGA_NOIS_CTRL_POS                         (12U)
#define AUADC_AUDADC_PGA_NOIS_CTRL_LEN                         (2U)
#define AUADC_AUDADC_PGA_NOIS_CTRL_MSK                         (((1U<<AUADC_AUDADC_PGA_NOIS_CTRL_LEN)-1)<<AUADC_AUDADC_PGA_NOIS_CTRL_POS)
#define AUADC_AUDADC_PGA_NOIS_CTRL_UMSK                        (~(((1U<<AUADC_AUDADC_PGA_NOIS_CTRL_LEN)-1)<<AUADC_AUDADC_PGA_NOIS_CTRL_POS))
#define AUADC_AUDADC_ICTRL_PGA_AAF                             AUADC_AUDADC_ICTRL_PGA_AAF
#define AUADC_AUDADC_ICTRL_PGA_AAF_POS                         (16U)
#define AUADC_AUDADC_ICTRL_PGA_AAF_LEN                         (2U)
#define AUADC_AUDADC_ICTRL_PGA_AAF_MSK                         (((1U<<AUADC_AUDADC_ICTRL_PGA_AAF_LEN)-1)<<AUADC_AUDADC_ICTRL_PGA_AAF_POS)
#define AUADC_AUDADC_ICTRL_PGA_AAF_UMSK                        (~(((1U<<AUADC_AUDADC_ICTRL_PGA_AAF_LEN)-1)<<AUADC_AUDADC_ICTRL_PGA_AAF_POS))
#define AUADC_AUDADC_ICTRL_PGA_MIC                             AUADC_AUDADC_ICTRL_PGA_MIC
#define AUADC_AUDADC_ICTRL_PGA_MIC_POS                         (20U)
#define AUADC_AUDADC_ICTRL_PGA_MIC_LEN                         (2U)
#define AUADC_AUDADC_ICTRL_PGA_MIC_MSK                         (((1U<<AUADC_AUDADC_ICTRL_PGA_MIC_LEN)-1)<<AUADC_AUDADC_ICTRL_PGA_MIC_POS)
#define AUADC_AUDADC_ICTRL_PGA_MIC_UMSK                        (~(((1U<<AUADC_AUDADC_ICTRL_PGA_MIC_LEN)-1)<<AUADC_AUDADC_ICTRL_PGA_MIC_POS))
#define AUADC_AUDADC_PGA_LP_EN                                 AUADC_AUDADC_PGA_LP_EN
#define AUADC_AUDADC_PGA_LP_EN_POS                             (24U)
#define AUADC_AUDADC_PGA_LP_EN_LEN                             (1U)
#define AUADC_AUDADC_PGA_LP_EN_MSK                             (((1U<<AUADC_AUDADC_PGA_LP_EN_LEN)-1)<<AUADC_AUDADC_PGA_LP_EN_POS)
#define AUADC_AUDADC_PGA_LP_EN_UMSK                            (~(((1U<<AUADC_AUDADC_PGA_LP_EN_LEN)-1)<<AUADC_AUDADC_PGA_LP_EN_POS))
#define AUADC_AUDADC_CKB_EN                                    AUADC_AUDADC_CKB_EN
#define AUADC_AUDADC_CKB_EN_POS                                (28U)
#define AUADC_AUDADC_CKB_EN_LEN                                (1U)
#define AUADC_AUDADC_CKB_EN_MSK                                (((1U<<AUADC_AUDADC_CKB_EN_LEN)-1)<<AUADC_AUDADC_CKB_EN_POS)
#define AUADC_AUDADC_CKB_EN_UMSK                               (~(((1U<<AUADC_AUDADC_CKB_EN_LEN)-1)<<AUADC_AUDADC_CKB_EN_POS))
#define AUADC_AUDADC_SEL_EDGE                                  AUADC_AUDADC_SEL_EDGE
#define AUADC_AUDADC_SEL_EDGE_POS                              (29U)
#define AUADC_AUDADC_SEL_EDGE_LEN                              (1U)
#define AUADC_AUDADC_SEL_EDGE_MSK                              (((1U<<AUADC_AUDADC_SEL_EDGE_LEN)-1)<<AUADC_AUDADC_SEL_EDGE_POS)
#define AUADC_AUDADC_SEL_EDGE_UMSK                             (~(((1U<<AUADC_AUDADC_SEL_EDGE_LEN)-1)<<AUADC_AUDADC_SEL_EDGE_POS))

/* 0xC64 : audadc_ana_cfg2 */
#define AUADC_AUDADC_ANA_CFG2_OFFSET                           (0x64)
#define AUADC_AUDADC_DITHER_ORDER                              AUADC_AUDADC_DITHER_ORDER
#define AUADC_AUDADC_DITHER_ORDER_POS                          (0U)
#define AUADC_AUDADC_DITHER_ORDER_LEN                          (1U)
#define AUADC_AUDADC_DITHER_ORDER_MSK                          (((1U<<AUADC_AUDADC_DITHER_ORDER_LEN)-1)<<AUADC_AUDADC_DITHER_ORDER_POS)
#define AUADC_AUDADC_DITHER_ORDER_UMSK                         (~(((1U<<AUADC_AUDADC_DITHER_ORDER_LEN)-1)<<AUADC_AUDADC_DITHER_ORDER_POS))
#define AUADC_AUDADC_DITHER_SEL                                AUADC_AUDADC_DITHER_SEL
#define AUADC_AUDADC_DITHER_SEL_POS                            (1U)
#define AUADC_AUDADC_DITHER_SEL_LEN                            (2U)
#define AUADC_AUDADC_DITHER_SEL_MSK                            (((1U<<AUADC_AUDADC_DITHER_SEL_LEN)-1)<<AUADC_AUDADC_DITHER_SEL_POS)
#define AUADC_AUDADC_DITHER_SEL_UMSK                           (~(((1U<<AUADC_AUDADC_DITHER_SEL_LEN)-1)<<AUADC_AUDADC_DITHER_SEL_POS))
#define AUADC_AUDADC_DITHER_ENA                                AUADC_AUDADC_DITHER_ENA
#define AUADC_AUDADC_DITHER_ENA_POS                            (3U)
#define AUADC_AUDADC_DITHER_ENA_LEN                            (1U)
#define AUADC_AUDADC_DITHER_ENA_MSK                            (((1U<<AUADC_AUDADC_DITHER_ENA_LEN)-1)<<AUADC_AUDADC_DITHER_ENA_POS)
#define AUADC_AUDADC_DITHER_ENA_UMSK                           (~(((1U<<AUADC_AUDADC_DITHER_ENA_LEN)-1)<<AUADC_AUDADC_DITHER_ENA_POS))
#define AUADC_AUDADC_QUAN_GAIN                                 AUADC_AUDADC_QUAN_GAIN
#define AUADC_AUDADC_QUAN_GAIN_POS                             (4U)
#define AUADC_AUDADC_QUAN_GAIN_LEN                             (2U)
#define AUADC_AUDADC_QUAN_GAIN_MSK                             (((1U<<AUADC_AUDADC_QUAN_GAIN_LEN)-1)<<AUADC_AUDADC_QUAN_GAIN_POS)
#define AUADC_AUDADC_QUAN_GAIN_UMSK                            (~(((1U<<AUADC_AUDADC_QUAN_GAIN_LEN)-1)<<AUADC_AUDADC_QUAN_GAIN_POS))
#define AUADC_AUDADC_DEM_EN                                    AUADC_AUDADC_DEM_EN
#define AUADC_AUDADC_DEM_EN_POS                                (8U)
#define AUADC_AUDADC_DEM_EN_LEN                                (1U)
#define AUADC_AUDADC_DEM_EN_MSK                                (((1U<<AUADC_AUDADC_DEM_EN_LEN)-1)<<AUADC_AUDADC_DEM_EN_POS)
#define AUADC_AUDADC_DEM_EN_UMSK                               (~(((1U<<AUADC_AUDADC_DEM_EN_LEN)-1)<<AUADC_AUDADC_DEM_EN_POS))
#define AUADC_AUDADC_NCTRL_ADC2                                AUADC_AUDADC_NCTRL_ADC2
#define AUADC_AUDADC_NCTRL_ADC2_POS                            (12U)
#define AUADC_AUDADC_NCTRL_ADC2_LEN                            (2U)
#define AUADC_AUDADC_NCTRL_ADC2_MSK                            (((1U<<AUADC_AUDADC_NCTRL_ADC2_LEN)-1)<<AUADC_AUDADC_NCTRL_ADC2_POS)
#define AUADC_AUDADC_NCTRL_ADC2_UMSK                           (~(((1U<<AUADC_AUDADC_NCTRL_ADC2_LEN)-1)<<AUADC_AUDADC_NCTRL_ADC2_POS))
#define AUADC_AUDADC_NCTRL_ADC1                                AUADC_AUDADC_NCTRL_ADC1
#define AUADC_AUDADC_NCTRL_ADC1_POS                            (16U)
#define AUADC_AUDADC_NCTRL_ADC1_LEN                            (3U)
#define AUADC_AUDADC_NCTRL_ADC1_MSK                            (((1U<<AUADC_AUDADC_NCTRL_ADC1_LEN)-1)<<AUADC_AUDADC_NCTRL_ADC1_POS)
#define AUADC_AUDADC_NCTRL_ADC1_UMSK                           (~(((1U<<AUADC_AUDADC_NCTRL_ADC1_LEN)-1)<<AUADC_AUDADC_NCTRL_ADC1_POS))
#define AUADC_AUDADC_ICTRL_ADC                                 AUADC_AUDADC_ICTRL_ADC
#define AUADC_AUDADC_ICTRL_ADC_POS                             (20U)
#define AUADC_AUDADC_ICTRL_ADC_LEN                             (2U)
#define AUADC_AUDADC_ICTRL_ADC_MSK                             (((1U<<AUADC_AUDADC_ICTRL_ADC_LEN)-1)<<AUADC_AUDADC_ICTRL_ADC_POS)
#define AUADC_AUDADC_ICTRL_ADC_UMSK                            (~(((1U<<AUADC_AUDADC_ICTRL_ADC_LEN)-1)<<AUADC_AUDADC_ICTRL_ADC_POS))
#define AUADC_AUDADC_SDM_LP_EN                                 AUADC_AUDADC_SDM_LP_EN
#define AUADC_AUDADC_SDM_LP_EN_POS                             (24U)
#define AUADC_AUDADC_SDM_LP_EN_LEN                             (1U)
#define AUADC_AUDADC_SDM_LP_EN_MSK                             (((1U<<AUADC_AUDADC_SDM_LP_EN_LEN)-1)<<AUADC_AUDADC_SDM_LP_EN_POS)
#define AUADC_AUDADC_SDM_LP_EN_UMSK                            (~(((1U<<AUADC_AUDADC_SDM_LP_EN_LEN)-1)<<AUADC_AUDADC_SDM_LP_EN_POS))
#define AUADC_AUDADC_RESERVED1                                  AUADC_AUDADC_RESERVED1
#define AUADC_AUDADC_RESERVED1_POS                              (28U)
#define AUADC_AUDADC_RESERVED1_LEN                              (1U)
#define AUADC_AUDADC_RESERVED1_MSK                              (((1U<<AUADC_AUDADC_RESERVED1_LEN)-1)<<AUADC_AUDADC_RESERVED1_POS)
#define AUADC_AUDADC_RESERVED1_UMSK                             (~(((1U<<AUADC_AUDADC_RESERVED1_LEN)-1)<<AUADC_AUDADC_RESERVED1_POS))

#define AUADC_AUDADC_RESERVED2                                  AUADC_AUDADC_RESERVED2
#define AUADC_AUDADC_RESERVED2_POS                              (29U)
#define AUADC_AUDADC_RESERVED2_LEN                              (1U)
#define AUADC_AUDADC_RESERVED2_MSK                              (((1U<<AUADC_AUDADC_RESERVED2_LEN)-1)<<AUADC_AUDADC_RESERVED2_POS)
#define AUADC_AUDADC_RESERVED2_UMSK                             (~(((1U<<AUADC_AUDADC_RESERVED2_LEN)-1)<<AUADC_AUDADC_RESERVED2_POS))

/* 0xC68 : audadc_cmd */
#define AUADC_AUDADC_CMD_OFFSET                                (0x68)
#define AUADC_AUDADC_MEAS_ODR_SEL                              AUADC_AUDADC_MEAS_ODR_SEL
#define AUADC_AUDADC_MEAS_ODR_SEL_POS                          (0U)
#define AUADC_AUDADC_MEAS_ODR_SEL_LEN                          (4U)
#define AUADC_AUDADC_MEAS_ODR_SEL_MSK                          (((1U<<AUADC_AUDADC_MEAS_ODR_SEL_LEN)-1)<<AUADC_AUDADC_MEAS_ODR_SEL_POS)
#define AUADC_AUDADC_MEAS_ODR_SEL_UMSK                         (~(((1U<<AUADC_AUDADC_MEAS_ODR_SEL_LEN)-1)<<AUADC_AUDADC_MEAS_ODR_SEL_POS))
#define AUADC_AUDADC_MEAS_FILTER_TYPE                          AUADC_AUDADC_MEAS_FILTER_TYPE
#define AUADC_AUDADC_MEAS_FILTER_TYPE_POS                      (4U)
#define AUADC_AUDADC_MEAS_FILTER_TYPE_LEN                      (1U)
#define AUADC_AUDADC_MEAS_FILTER_TYPE_MSK                      (((1U<<AUADC_AUDADC_MEAS_FILTER_TYPE_LEN)-1)<<AUADC_AUDADC_MEAS_FILTER_TYPE_POS)
#define AUADC_AUDADC_MEAS_FILTER_TYPE_UMSK                     (~(((1U<<AUADC_AUDADC_MEAS_FILTER_TYPE_LEN)-1)<<AUADC_AUDADC_MEAS_FILTER_TYPE_POS))
#define AUADC_AUDADC_MEAS_FILTER_EN                            AUADC_AUDADC_MEAS_FILTER_EN
#define AUADC_AUDADC_MEAS_FILTER_EN_POS                        (5U)
#define AUADC_AUDADC_MEAS_FILTER_EN_LEN                        (1U)
#define AUADC_AUDADC_MEAS_FILTER_EN_MSK                        (((1U<<AUADC_AUDADC_MEAS_FILTER_EN_LEN)-1)<<AUADC_AUDADC_MEAS_FILTER_EN_POS)
#define AUADC_AUDADC_MEAS_FILTER_EN_UMSK                       (~(((1U<<AUADC_AUDADC_MEAS_FILTER_EN_LEN)-1)<<AUADC_AUDADC_MEAS_FILTER_EN_POS))
#define AUADC_AUDADC_AUDIO_OSR_SEL                             AUADC_AUDADC_AUDIO_OSR_SEL
#define AUADC_AUDADC_AUDIO_OSR_SEL_POS                         (6U)
#define AUADC_AUDADC_AUDIO_OSR_SEL_LEN                         (1U)
#define AUADC_AUDADC_AUDIO_OSR_SEL_MSK                         (((1U<<AUADC_AUDADC_AUDIO_OSR_SEL_LEN)-1)<<AUADC_AUDADC_AUDIO_OSR_SEL_POS)
#define AUADC_AUDADC_AUDIO_OSR_SEL_UMSK                        (~(((1U<<AUADC_AUDADC_AUDIO_OSR_SEL_LEN)-1)<<AUADC_AUDADC_AUDIO_OSR_SEL_POS))
#define AUADC_AUDADC_PGA_GAIN                                  AUADC_AUDADC_PGA_GAIN
#define AUADC_AUDADC_PGA_GAIN_POS                              (8U)
#define AUADC_AUDADC_PGA_GAIN_LEN                              (4U)
#define AUADC_AUDADC_PGA_GAIN_MSK                              (((1U<<AUADC_AUDADC_PGA_GAIN_LEN)-1)<<AUADC_AUDADC_PGA_GAIN_POS)
#define AUADC_AUDADC_PGA_GAIN_UMSK                             (~(((1U<<AUADC_AUDADC_PGA_GAIN_LEN)-1)<<AUADC_AUDADC_PGA_GAIN_POS))
#define AUADC_AUDADC_PGA_MODE                                  AUADC_AUDADC_PGA_MODE
#define AUADC_AUDADC_PGA_MODE_POS                              (12U)
#define AUADC_AUDADC_PGA_MODE_LEN                              (2U)
#define AUADC_AUDADC_PGA_MODE_MSK                              (((1U<<AUADC_AUDADC_PGA_MODE_LEN)-1)<<AUADC_AUDADC_PGA_MODE_POS)
#define AUADC_AUDADC_PGA_MODE_UMSK                             (~(((1U<<AUADC_AUDADC_PGA_MODE_LEN)-1)<<AUADC_AUDADC_PGA_MODE_POS))
#define AUADC_AUDADC_CHANNEL_SELN                              AUADC_AUDADC_CHANNEL_SELN
#define AUADC_AUDADC_CHANNEL_SELN_POS                          (16U)
#define AUADC_AUDADC_CHANNEL_SELN_LEN                          (3U)
#define AUADC_AUDADC_CHANNEL_SELN_MSK                          (((1U<<AUADC_AUDADC_CHANNEL_SELN_LEN)-1)<<AUADC_AUDADC_CHANNEL_SELN_POS)
#define AUADC_AUDADC_CHANNEL_SELN_UMSK                         (~(((1U<<AUADC_AUDADC_CHANNEL_SELN_LEN)-1)<<AUADC_AUDADC_CHANNEL_SELN_POS))
#define AUADC_AUDADC_CHANNEL_SELP                              AUADC_AUDADC_CHANNEL_SELP
#define AUADC_AUDADC_CHANNEL_SELP_POS                          (20U)
#define AUADC_AUDADC_CHANNEL_SELP_LEN                          (3U)
#define AUADC_AUDADC_CHANNEL_SELP_MSK                          (((1U<<AUADC_AUDADC_CHANNEL_SELP_LEN)-1)<<AUADC_AUDADC_CHANNEL_SELP_POS)
#define AUADC_AUDADC_CHANNEL_SELP_UMSK                         (~(((1U<<AUADC_AUDADC_CHANNEL_SELP_LEN)-1)<<AUADC_AUDADC_CHANNEL_SELP_POS))
#define AUADC_AUDADC_CHANNEL_EN                                AUADC_AUDADC_CHANNEL_EN
#define AUADC_AUDADC_CHANNEL_EN_POS                            (24U)
#define AUADC_AUDADC_CHANNEL_EN_LEN                            (2U)
#define AUADC_AUDADC_CHANNEL_EN_MSK                            (((1U<<AUADC_AUDADC_CHANNEL_EN_LEN)-1)<<AUADC_AUDADC_CHANNEL_EN_POS)
#define AUADC_AUDADC_CHANNEL_EN_UMSK                           (~(((1U<<AUADC_AUDADC_CHANNEL_EN_LEN)-1)<<AUADC_AUDADC_CHANNEL_EN_POS))
#define AUADC_AUDADC_CONV                                      AUADC_AUDADC_CONV
#define AUADC_AUDADC_CONV_POS                                  (28U)
#define AUADC_AUDADC_CONV_LEN                                  (1U)
#define AUADC_AUDADC_CONV_MSK                                  (((1U<<AUADC_AUDADC_CONV_LEN)-1)<<AUADC_AUDADC_CONV_POS)
#define AUADC_AUDADC_CONV_UMSK                                 (~(((1U<<AUADC_AUDADC_CONV_LEN)-1)<<AUADC_AUDADC_CONV_POS))
#define AUADC_AUDADC_SDM_PU                                    AUADC_AUDADC_SDM_PU
#define AUADC_AUDADC_SDM_PU_POS                                (29U)
#define AUADC_AUDADC_SDM_PU_LEN                                (1U)
#define AUADC_AUDADC_SDM_PU_MSK                                (((1U<<AUADC_AUDADC_SDM_PU_LEN)-1)<<AUADC_AUDADC_SDM_PU_POS)
#define AUADC_AUDADC_SDM_PU_UMSK                               (~(((1U<<AUADC_AUDADC_SDM_PU_LEN)-1)<<AUADC_AUDADC_SDM_PU_POS))
#define AUADC_AUDADC_PGA_PU                                    AUADC_AUDADC_PGA_PU
#define AUADC_AUDADC_PGA_PU_POS                                (30U)
#define AUADC_AUDADC_PGA_PU_LEN                                (1U)
#define AUADC_AUDADC_PGA_PU_MSK                                (((1U<<AUADC_AUDADC_PGA_PU_LEN)-1)<<AUADC_AUDADC_PGA_PU_POS)
#define AUADC_AUDADC_PGA_PU_UMSK                               (~(((1U<<AUADC_AUDADC_PGA_PU_LEN)-1)<<AUADC_AUDADC_PGA_PU_POS))

