bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/auadc_reg.h
/* 0xC6C : audadc_data */
#define AUADC_AUDADC_DATA_OFFSET                               (0x6C)
#define AUADC_AUDADC_RAW_DATA                                  AUADC_AUDADC_RAW_DATA
#define AUADC_AUDADC_RAW_DATA_POS                              (0U)
#define AUADC_AUDADC_RAW_DATA_LEN                              (24U)
#define AUADC_AUDADC_RAW_DATA_MSK                              (((1U<<AUADC_AUDADC_RAW_DATA_LEN)-1)<<AUADC_AUDADC_RAW_DATA_POS)
#define AUADC_AUDADC_RAW_DATA_UMSK                             (~(((1U<<AUADC_AUDADC_RAW_DATA_LEN)-1)<<AUADC_AUDADC_RAW_DATA_POS))
#define AUADC_AUDADC_DATA_RDY                                  AUADC_AUDADC_DATA_RDY
#define AUADC_AUDADC_DATA_RDY_POS                              (24U)
#define AUADC_AUDADC_DATA_RDY_LEN                              (1U)
#define AUADC_AUDADC_DATA_RDY_MSK                              (((1U<<AUADC_AUDADC_DATA_RDY_LEN)-1)<<AUADC_AUDADC_DATA_RDY_POS)
#define AUADC_AUDADC_DATA_RDY_UMSK                             (~(((1U<<AUADC_AUDADC_DATA_RDY_LEN)-1)<<AUADC_AUDADC_DATA_RDY_POS))
#define AUADC_AUDADC_SOFT_RST                                  AUADC_AUDADC_SOFT_RST
#define AUADC_AUDADC_SOFT_RST_POS                              (29U)
#define AUADC_AUDADC_SOFT_RST_LEN                              (1U)
#define AUADC_AUDADC_SOFT_RST_MSK                              (((1U<<AUADC_AUDADC_SOFT_RST_LEN)-1)<<AUADC_AUDADC_SOFT_RST_POS)
#define AUADC_AUDADC_SOFT_RST_UMSK                             (~(((1U<<AUADC_AUDADC_SOFT_RST_LEN)-1)<<AUADC_AUDADC_SOFT_RST_POS))
#define AUADC_AUDADC_VALID_4S_VAL                              AUADC_AUDADC_VALID_4S_VAL
#define AUADC_AUDADC_VALID_4S_VAL_POS                          (30U)
#define AUADC_AUDADC_VALID_4S_VAL_LEN                          (1U)
#define AUADC_AUDADC_VALID_4S_VAL_MSK                          (((1U<<AUADC_AUDADC_VALID_4S_VAL_LEN)-1)<<AUADC_AUDADC_VALID_4S_VAL_POS)
#define AUADC_AUDADC_VALID_4S_VAL_UMSK                         (~(((1U<<AUADC_AUDADC_VALID_4S_VAL_LEN)-1)<<AUADC_AUDADC_VALID_4S_VAL_POS))
#define AUADC_AUDADC_VALID_4S_EN                               AUADC_AUDADC_VALID_4S_EN
#define AUADC_AUDADC_VALID_4S_EN_POS                           (31U)
#define AUADC_AUDADC_VALID_4S_EN_LEN                           (1U)
#define AUADC_AUDADC_VALID_4S_EN_MSK                           (((1U<<AUADC_AUDADC_VALID_4S_EN_LEN)-1)<<AUADC_AUDADC_VALID_4S_EN_POS)
#define AUADC_AUDADC_VALID_4S_EN_UMSK                          (~(((1U<<AUADC_AUDADC_VALID_4S_EN_LEN)-1)<<AUADC_AUDADC_VALID_4S_EN_POS))

/* 0xC80 : audadc_rx_fifo_ctrl */
#define AUADC_AUDADC_RX_FIFO_CTRL_OFFSET                       (0x80)
#define AUADC_RX_FIFO_FLUSH                                    AUADC_RX_FIFO_FLUSH
#define AUADC_RX_FIFO_FLUSH_POS                                (0U)
#define AUADC_RX_FIFO_FLUSH_LEN                                (1U)
#define AUADC_RX_FIFO_FLUSH_MSK                                (((1U<<AUADC_RX_FIFO_FLUSH_LEN)-1)<<AUADC_RX_FIFO_FLUSH_POS)
#define AUADC_RX_FIFO_FLUSH_UMSK                               (~(((1U<<AUADC_RX_FIFO_FLUSH_LEN)-1)<<AUADC_RX_FIFO_FLUSH_POS))
#define AUADC_RXO_INT_EN                                       AUADC_RXO_INT_EN
#define AUADC_RXO_INT_EN_POS                                   (1U)
#define AUADC_RXO_INT_EN_LEN                                   (1U)
#define AUADC_RXO_INT_EN_MSK                                   (((1U<<AUADC_RXO_INT_EN_LEN)-1)<<AUADC_RXO_INT_EN_POS)
#define AUADC_RXO_INT_EN_UMSK                                  (~(((1U<<AUADC_RXO_INT_EN_LEN)-1)<<AUADC_RXO_INT_EN_POS))
#define AUADC_RXU_INT_EN                                       AUADC_RXU_INT_EN
#define AUADC_RXU_INT_EN_POS                                   (2U)
#define AUADC_RXU_INT_EN_LEN                                   (1U)
#define AUADC_RXU_INT_EN_MSK                                   (((1U<<AUADC_RXU_INT_EN_LEN)-1)<<AUADC_RXU_INT_EN_POS)
#define AUADC_RXU_INT_EN_UMSK                                  (~(((1U<<AUADC_RXU_INT_EN_LEN)-1)<<AUADC_RXU_INT_EN_POS))
#define AUADC_RXA_INT_EN                                       AUADC_RXA_INT_EN
#define AUADC_RXA_INT_EN_POS                                   (3U)
#define AUADC_RXA_INT_EN_LEN                                   (1U)
#define AUADC_RXA_INT_EN_MSK                                   (((1U<<AUADC_RXA_INT_EN_LEN)-1)<<AUADC_RXA_INT_EN_POS)
#define AUADC_RXA_INT_EN_UMSK                                  (~(((1U<<AUADC_RXA_INT_EN_LEN)-1)<<AUADC_RXA_INT_EN_POS))
#define AUADC_RX_DRQ_EN                                        AUADC_RX_DRQ_EN
#define AUADC_RX_DRQ_EN_POS                                    (4U)
#define AUADC_RX_DRQ_EN_LEN                                    (1U)
#define AUADC_RX_DRQ_EN_MSK                                    (((1U<<AUADC_RX_DRQ_EN_LEN)-1)<<AUADC_RX_DRQ_EN_POS)
#define AUADC_RX_DRQ_EN_UMSK                                   (~(((1U<<AUADC_RX_DRQ_EN_LEN)-1)<<AUADC_RX_DRQ_EN_POS))
#define AUADC_RX_DATA_RES                                      AUADC_RX_DATA_RES
#define AUADC_RX_DATA_RES_POS                                  (5U)
#define AUADC_RX_DATA_RES_LEN                                  (2U)
#define AUADC_RX_DATA_RES_MSK                                  (((1U<<AUADC_RX_DATA_RES_LEN)-1)<<AUADC_RX_DATA_RES_POS)
#define AUADC_RX_DATA_RES_UMSK                                 (~(((1U<<AUADC_RX_DATA_RES_LEN)-1)<<AUADC_RX_DATA_RES_POS))
#define AUADC_RX_CH_EN                                         AUADC_RX_CH_EN
#define AUADC_RX_CH_EN_POS                                     (8U)
#define AUADC_RX_CH_EN_LEN                                     (1U)
#define AUADC_RX_CH_EN_MSK                                     (((1U<<AUADC_RX_CH_EN_LEN)-1)<<AUADC_RX_CH_EN_POS)
#define AUADC_RX_CH_EN_UMSK                                    (~(((1U<<AUADC_RX_CH_EN_LEN)-1)<<AUADC_RX_CH_EN_POS))
#define AUADC_RX_DRQ_CNT                                       AUADC_RX_DRQ_CNT
#define AUADC_RX_DRQ_CNT_POS                                   (14U)
#define AUADC_RX_DRQ_CNT_LEN                                   (2U)
#define AUADC_RX_DRQ_CNT_MSK                                   (((1U<<AUADC_RX_DRQ_CNT_LEN)-1)<<AUADC_RX_DRQ_CNT_POS)
#define AUADC_RX_DRQ_CNT_UMSK                                  (~(((1U<<AUADC_RX_DRQ_CNT_LEN)-1)<<AUADC_RX_DRQ_CNT_POS))
#define AUADC_RX_TRG_LEVEL                                     AUADC_RX_TRG_LEVEL
#define AUADC_RX_TRG_LEVEL_POS                                 (16U)
#define AUADC_RX_TRG_LEVEL_LEN                                 (4U)
#define AUADC_RX_TRG_LEVEL_MSK                                 (((1U<<AUADC_RX_TRG_LEVEL_LEN)-1)<<AUADC_RX_TRG_LEVEL_POS)
#define AUADC_RX_TRG_LEVEL_UMSK                                (~(((1U<<AUADC_RX_TRG_LEVEL_LEN)-1)<<AUADC_RX_TRG_LEVEL_POS))
#define AUADC_RX_DATA_MODE                                     AUADC_RX_DATA_MODE
#define AUADC_RX_DATA_MODE_POS                                 (24U)
#define AUADC_RX_DATA_MODE_LEN                                 (2U)
#define AUADC_RX_DATA_MODE_MSK                                 (((1U<<AUADC_RX_DATA_MODE_LEN)-1)<<AUADC_RX_DATA_MODE_POS)
#define AUADC_RX_DATA_MODE_UMSK                                (~(((1U<<AUADC_RX_DATA_MODE_LEN)-1)<<AUADC_RX_DATA_MODE_POS))

/* 0xC84 : audadc_rx_fifo_status */
#define AUADC_AUDADC_RX_FIFO_STATUS_OFFSET                     (0x84)
#define AUADC_RXO_INT                                          AUADC_RXO_INT
#define AUADC_RXO_INT_POS                                      (1U)
#define AUADC_RXO_INT_LEN                                      (1U)
#define AUADC_RXO_INT_MSK                                      (((1U<<AUADC_RXO_INT_LEN)-1)<<AUADC_RXO_INT_POS)
#define AUADC_RXO_INT_UMSK                                     (~(((1U<<AUADC_RXO_INT_LEN)-1)<<AUADC_RXO_INT_POS))
#define AUADC_RXU_INT                                          AUADC_RXU_INT
#define AUADC_RXU_INT_POS                                      (2U)
#define AUADC_RXU_INT_LEN                                      (1U)
#define AUADC_RXU_INT_MSK                                      (((1U<<AUADC_RXU_INT_LEN)-1)<<AUADC_RXU_INT_POS)
#define AUADC_RXU_INT_UMSK                                     (~(((1U<<AUADC_RXU_INT_LEN)-1)<<AUADC_RXU_INT_POS))
#define AUADC_RXA_INT                                          AUADC_RXA_INT
#define AUADC_RXA_INT_POS                                      (4U)
#define AUADC_RXA_INT_LEN                                      (1U)
#define AUADC_RXA_INT_MSK                                      (((1U<<AUADC_RXA_INT_LEN)-1)<<AUADC_RXA_INT_POS)
#define AUADC_RXA_INT_UMSK                                     (~(((1U<<AUADC_RXA_INT_LEN)-1)<<AUADC_RXA_INT_POS))
#define AUADC_RXA_CNT                                          AUADC_RXA_CNT
#define AUADC_RXA_CNT_POS                                      (16U)
#define AUADC_RXA_CNT_LEN                                      (4U)
#define AUADC_RXA_CNT_MSK                                      (((1U<<AUADC_RXA_CNT_LEN)-1)<<AUADC_RXA_CNT_POS)
#define AUADC_RXA_CNT_UMSK                                     (~(((1U<<AUADC_RXA_CNT_LEN)-1)<<AUADC_RXA_CNT_POS))
#define AUADC_RXA                                              AUADC_RXA
#define AUADC_RXA_POS                                          (24U)
#define AUADC_RXA_LEN                                          (1U)
#define AUADC_RXA_MSK                                          (((1U<<AUADC_RXA_LEN)-1)<<AUADC_RXA_POS)
#define AUADC_RXA_UMSK                                         (~(((1U<<AUADC_RXA_LEN)-1)<<AUADC_RXA_POS))

/* 0xC88 : audadc_rx_fifo_data */
#define AUADC_AUDADC_RX_FIFO_DATA_OFFSET                       (0x88)
#define AUADC_RX_DATA                                          AUADC_RX_DATA
#define AUADC_RX_DATA_POS                                      (0U)
#define AUADC_RX_DATA_LEN                                      (32U)
#define AUADC_RX_DATA_MSK                                      (((1U<<AUADC_RX_DATA_LEN)-1)<<AUADC_RX_DATA_POS)
#define AUADC_RX_DATA_UMSK                                     (~(((1U<<AUADC_RX_DATA_LEN)-1)<<AUADC_RX_DATA_POS))


struct  auadc_reg {
    /* 0x0  reserved */
    uint8_t RESERVED0x0[3072];

    /* 0xC00 : audpdm_top */
    union {
        struct {
            uint32_t audio_ckg_en                   :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1                     :  1; /* [    1],       rsvd,        0x0 */
            uint32_t adc_itf_inv_sel                :  1; /* [    2],        r/w,        0x0 */
            uint32_t pdm_itf_inv_sel                :  1; /* [    3],        r/w,        0x0 */
            uint32_t reserved_4_27                  : 24; /* [27: 4],       rsvd,        0x0 */
            uint32_t adc_rate                       :  4; /* [31:28],        r/w,        0x1 */
        }BF;
        uint32_t WORD;
    } audpdm_top;

