bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/auadc_reg.h
    /* 0xC04 : audpdm_itf */
    union {
        struct {
            uint32_t adc_0_en                       :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_29                  : 29; /* [29: 1],       rsvd,        0x0 */
            uint32_t adc_itf_en                     :  1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audpdm_itf;

    /* 0xC08 : pdm_adc_0 */
    union {
        struct {
            uint32_t adc_0_fir_mode                 :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_31                  : 31; /* [31: 1],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_adc_0;

    /* 0xC0C : pdm_adc_1 */
    union {
        struct {
            uint32_t adc_0_k1                       :  4; /* [ 3: 0],        r/w,        0x8 */
            uint32_t adc_0_k1_en                    :  1; /* [    4],        r/w,        0x1 */
            uint32_t adc_0_k2                       :  4; /* [ 8: 5],        r/w,        0xd */
            uint32_t adc_0_k2_en                    :  1; /* [    9],        r/w,        0x0 */
            uint32_t reserved_10_31                 : 22; /* [31:10],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_adc_1;

    /* 0xC10 : pdm_dac_0 */
    union {
        struct {
            uint32_t adc_pdm_h                      :  4; /* [ 3: 0],        r/w,        0x6 */
            uint32_t reserved_4_5                   :  2; /* [ 5: 4],       rsvd,        0x0 */
            uint32_t adc_pdm_l                      :  4; /* [ 9: 6],        r/w,        0xa */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t adc_0_src                      :  1; /* [   12],        r/w,        0x0 */
            uint32_t reserved_13_31                 : 19; /* [31:13],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dac_0;

    /* 0xc14  reserved */
    uint8_t RESERVED0xc14[8];

    /* 0xC1C : pdm_pdm_0 */
    union {
        struct {
            uint32_t pdm_0_en                       :  1; /* [    0],        r/w,        0x0 */
            uint32_t reserved_1_2                   :  2; /* [ 2: 1],       rsvd,        0x0 */
            uint32_t adc_0_pdm_sel                  :  3; /* [ 5: 3],        r/w,        0x0 */
            uint32_t reserved_6_31                  : 26; /* [31: 6],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_pdm_0;

    /* 0xC20 : pdm_rsvd0 */
    union {
        struct {
            uint32_t rsvd0                          : 32; /* [31: 0],        r/w,     0xffff */
        }BF;
        uint32_t WORD;
    } pdm_rsvd0;

    /* 0xC24 : pdm_dbg_0 */
    union {
        struct {
            uint32_t reserved_0_20                  : 21; /* [20: 0],       rsvd,        0x0 */
            uint32_t adc_test_clkin_en              :  1; /* [   21],        r/w,        0x0 */
            uint32_t reserved_22                    :  1; /* [   22],       rsvd,        0x0 */
            uint32_t adc_test_din_en                :  1; /* [   23],        r/w,        0x0 */
            uint32_t aud_test_read_sel              :  6; /* [29:24],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dbg_0;

    /* 0xC28 : pdm_dbg_1 */
    union {
        struct {
            uint32_t aud_test_read                  : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dbg_1;

    /* 0xC2C : pdm_dbg_2 */
    union {
        struct {
            uint32_t adc_fir_4s_val                 : 20; /* [19: 0],        r/w,        0x0 */
            uint32_t adc_0_fir_4s_en                :  1; /* [   20],        r/w,        0x0 */
            uint32_t reserved_21_31                 : 11; /* [31:21],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dbg_2;

    /* 0xC30 : pdm_dbg_3 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dbg_3;

    /* 0xC34 : pdm_dbg_4 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_dbg_4;

    /* 0xC38 : pdm_adc_s0 */
    union {
        struct {
            uint32_t adc_s0_volume                  :  9; /* [ 8: 0],        r/w,        0x0 */
            uint32_t reserved_9_31                  : 23; /* [31: 9],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_adc_s0;

    /* 0xC3C : pdm_adc_s1 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_adc_s1;

    /* 0xC40 : pdm_adc_s2 */
    union {
        struct {
            uint32_t reserved_0_31                  : 32; /* [31: 0],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } pdm_adc_s2;

    /* 0xc44  reserved */
    uint8_t RESERVED0xc44[28];

    /* 0xC60 : audadc_ana_cfg1 */
    union {
        struct {
            uint32_t audadc_pga_chop_cksel          :  1; /* [    0],        r/w,        0x0 */
            uint32_t audadc_pga_chop_freq           :  3; /* [ 3: 1],        r/w,        0x4 */
            uint32_t audadc_pga_chop_en             :  1; /* [    4],        r/w,        0x1 */
            uint32_t audadc_pga_chop_cfg            :  2; /* [ 6: 5],        r/w,        0x3 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t audadc_pga_rhpas_sel           :  2; /* [ 9: 8],        r/w,        0x0 */
            uint32_t reserved_10_11                 :  2; /* [11:10],       rsvd,        0x0 */
            uint32_t audadc_pga_nois_ctrl           :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t audadc_ictrl_pga_aaf           :  2; /* [17:16],        r/w,        0x1 */
            uint32_t reserved_18_19                 :  2; /* [19:18],       rsvd,        0x0 */
            uint32_t audadc_ictrl_pga_mic           :  2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t audadc_pga_lp_en               :  1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27                 :  3; /* [27:25],       rsvd,        0x0 */
            uint32_t audadc_ckb_en                  :  1; /* [   28],        r/w,        0x0 */
            uint32_t audadc_sel_edge                :  1; /* [   29],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_ana_cfg1;

    /* 0xC64 : audadc_ana_cfg2 */
    union {
        struct {
            uint32_t audadc_dither_order            :  1; /* [    0],        r/w,        0x0 */
            uint32_t audadc_dither_sel              :  2; /* [ 2: 1],        r/w,        0x2 */
            uint32_t audadc_dither_ena              :  1; /* [    3],        r/w,        0x1 */
            uint32_t audadc_quan_gain               :  2; /* [ 5: 4],        r/w,        0x1 */
            uint32_t reserved_6_7                   :  2; /* [ 7: 6],       rsvd,        0x0 */
            uint32_t audadc_dem_en                  :  1; /* [    8],        r/w,        0x1 */
            uint32_t reserved_9_11                  :  3; /* [11: 9],       rsvd,        0x0 */
            uint32_t audadc_nctrl_adc2              :  2; /* [13:12],        r/w,        0x1 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t audadc_nctrl_adc1              :  3; /* [18:16],        r/w,        0x3 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t audadc_ictrl_adc               :  2; /* [21:20],        r/w,        0x1 */
            uint32_t reserved_22_23                 :  2; /* [23:22],       rsvd,        0x0 */
            uint32_t audadc_sdm_lp_en               :  1; /* [   24],        r/w,        0x0 */
            uint32_t reserved_25_27                 :  3; /* [27:25],       rsvd,        0x0 */
            uint32_t audadc_reserved                :  2; /* [29:28],        r/w,        0x0 */
            uint32_t reserved_30_31                 :  2; /* [31:30],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_ana_cfg2;

    /* 0xC68 : audadc_cmd */
    union {
        struct {
            uint32_t audadc_meas_odr_sel            :  4; /* [ 3: 0],        r/w,        0x3 */
            uint32_t audadc_meas_filter_type        :  1; /* [    4],        r/w,        0x0 */
            uint32_t audadc_meas_filter_en          :  1; /* [    5],        r/w,        0x0 */
            uint32_t audadc_audio_osr_sel           :  1; /* [    6],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t audadc_pga_gain                :  4; /* [11: 8],        r/w,        0x0 */
            uint32_t audadc_pga_mode                :  2; /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14_15                 :  2; /* [15:14],       rsvd,        0x0 */
            uint32_t audadc_channel_seln            :  3; /* [18:16],        r/w,        0x0 */
            uint32_t reserved_19                    :  1; /* [   19],       rsvd,        0x0 */
            uint32_t audadc_channel_selp            :  3; /* [22:20],        r/w,        0x0 */
            uint32_t reserved_23                    :  1; /* [   23],       rsvd,        0x0 */
            uint32_t audadc_channel_en              :  2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_27                 :  2; /* [27:26],       rsvd,        0x0 */
            uint32_t audadc_conv                    :  1; /* [   28],        r/w,        0x0 */
            uint32_t audadc_sdm_pu                  :  1; /* [   29],        r/w,        0x0 */
            uint32_t audadc_pga_pu                  :  1; /* [   30],        r/w,        0x0 */
            uint32_t reserved_31                    :  1; /* [   31],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_cmd;

    /* 0xC6C : audadc_data */
    union {
        struct {
            uint32_t audadc_raw_data                : 24; /* [23: 0],          r,        0x0 */
            uint32_t audadc_data_rdy                :  1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_28                 :  4; /* [28:25],       rsvd,        0x0 */
            uint32_t audadc_soft_rst                :  1; /* [   29],        r/w,        0x0 */
            uint32_t audadc_valid_4s_val            :  1; /* [   30],        r/w,        0x0 */
            uint32_t audadc_valid_4s_en             :  1; /* [   31],        r/w,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_data;

    /* 0xc70  reserved */
    uint8_t RESERVED0xc70[16];

    /* 0xC80 : audadc_rx_fifo_ctrl */
    union {
        struct {
            uint32_t rx_fifo_flush                  :  1; /* [    0],        w1c,        0x0 */
            uint32_t rxo_int_en                     :  1; /* [    1],        r/w,        0x0 */
            uint32_t rxu_int_en                     :  1; /* [    2],        r/w,        0x0 */
            uint32_t rxa_int_en                     :  1; /* [    3],        r/w,        0x0 */
            uint32_t rx_drq_en                      :  1; /* [    4],        r/w,        0x0 */
            uint32_t rx_data_res                    :  2; /* [ 6: 5],        r/w,        0x0 */
            uint32_t reserved_7                     :  1; /* [    7],       rsvd,        0x0 */
            uint32_t rx_ch_en                       :  1; /* [    8],        r/w,        0x0 */
            uint32_t reserved_9_13                  :  5; /* [13: 9],       rsvd,        0x0 */
            uint32_t rx_drq_cnt                     :  2; /* [15:14],        r/w,        0x0 */
            uint32_t rx_trg_level                   :  4; /* [19:16],        r/w,        0x3 */
            uint32_t reserved_20_23                 :  4; /* [23:20],       rsvd,        0x0 */
            uint32_t rx_data_mode                   :  2; /* [25:24],        r/w,        0x0 */
            uint32_t reserved_26_31                 :  6; /* [31:26],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_rx_fifo_ctrl;

    /* 0xC84 : audadc_rx_fifo_status */
    union {
        struct {
            uint32_t reserved_0                     :  1; /* [    0],       rsvd,        0x0 */
            uint32_t rxo_int                        :  1; /* [    1],          r,        0x0 */
            uint32_t rxu_int                        :  1; /* [    2],          r,        0x0 */
            uint32_t reserved_3                     :  1; /* [    3],       rsvd,        0x0 */
            uint32_t rxa_int                        :  1; /* [    4],          r,        0x0 */
            uint32_t reserved_5_15                  : 11; /* [15: 5],       rsvd,        0x0 */
            uint32_t rxa_cnt                        :  4; /* [19:16],          r,        0x0 */
            uint32_t reserved_20_23                 :  4; /* [23:20],       rsvd,        0x0 */
            uint32_t rxa                            :  1; /* [   24],          r,        0x0 */
            uint32_t reserved_25_31                 :  7; /* [31:25],       rsvd,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_rx_fifo_status;

    /* 0xC88 : audadc_rx_fifo_data */
    union {
        struct {
            uint32_t rx_data                        : 32; /* [31: 0],          r,        0x0 */
        }BF;
        uint32_t WORD;
    } audadc_rx_fifo_data;

};

typedef volatile struct auadc_reg auadc_reg_t;


#endif  /* __AUADC_REG_H__ */
